sercankuslu/astromonty/Programms/PIC18F97J60/MainDemo.c
		#if defined(WF_CS_TRIS)
			WFEintISR();
		#endif // WF_CS_TRIS
	}

	#if !defined(HI_TECH_C)
	#pragma code lowVector=0x18
	void LowVector(void){_asm goto LowISR _endasm}
	#pragma code highVector=0x8
	void HighVector(void){_asm goto HighISR _endasm}
	#pragma code // Return to default code section
	#endif

// C30 and C32 Exception Handlers
// If your code gets here, you either tried to read or write
// a NULL pointer, or your application overflowed the stack
// by having too many local variables or parameters declared.
#elif defined(__C30__)
	void _ISR __attribute__((__no_auto_psv__)) _AddressError(void)
	{
	    Nop();
		Nop();
	}
	void _ISR __attribute__((__no_auto_psv__)) _StackError(void)
	{
	    Nop();
		Nop();
	}
	
#elif defined(__C32__)
	void _general_exception_handler(unsigned cause, unsigned status)
	{
		Nop();
		Nop();
	}
#endif

static BYTE lcd_init_sequence[] =
{
	
	cmdLCD_DEFAULT_PAGE
	,
	cmdLCD_COMMAND_PAGE
	| paramLCD_PAGE_DISPLAY_SETTINGS
	,
	cmdLCD_BIAS_SYSTEM
	| paramLCD_BIAS_9 // Bias 1/9, MUX 1:65
	,
	cmdLCD_MULTILPEX_RATE
	| paramLCD_MUX_65
	,
	cmdLCD_DISPLAY_CONTROL
	| paramLCD_ALL_ON
	,
	cmdLCD_EXT_DISPLAY_CTL
	| paramLCD_XDIRECTION_NORMAL
	| paramLCD_YDIRECTION_NORMAL
	,
	cmdLCD_DISPLAY_SIZE
	| paramLCD_LARGE_DISPLAY
	,
	
	cmdLCD_DEFAULT_PAGE
	,
	cmdLCD_COMMAND_PAGE
	| paramLCD_PAGE_HV_GEN
	,
	cmdLCD_HV_GEN_CONTROL
	| paramLCD_HV_ENABLED
	| paramLCD_VLCD_LOW
	,
	cmdLCD_HV_GEN_STAGES
	| paramLCD_HV_MUL3
	,
	cmdLCD_TEMP_COEFF
	| paramLCD_TC_274
	,
	cmdLCD_VLCD_CONTROL
	| 51
	,
	
	cmdLCD_DEFAULT_PAGE
	,
	cmdLCD_COMMAND_PAGE
	| paramLCD_PAGE_SPECIAL_FEATURE
	,
	cmdLCD_STATE_CONTROL
	| 0
	,
	cmdLCD_OSC_SETTING
	| paramLCD_OSC_INTERNAL
	,
	cmdLCD_COG_TCP
	| paramLCD_BOT_ROW_SWAP_ENABLED
	| paramLCD_TOP_ROW_SWAP_ENABLED
	,
	
	cmdLCD_DEFAULT_PAGE
	,
	cmdLCD_FUNCTION_SET
	| paramLCD_ACTIVE
	| paramLCD_HORIZONTAL_ADDRESSING
	,
	cmdLCD_RAM_PAGE
	| paramLCD_PAGE0
	,
	cmdLCD_SET_Y
	| 0
	, 
	cmdLCD_SET_X
	| 0
	,
};
//
// Main application entry point.
//
#if defined(__18CXX)
void main(void)
#else
int main(void)
#endif
{
	static DWORD t = 0;
	static DWORD t1 = 0;
	static DWORD dwLastIP = 0;
	BYTE b = 0;
	
	OSCTUNE = 0x40;
	OSCCON = 0x02;

	TRISAbits.TRISA0=0;
	TRISAbits.TRISA1=0;
	LATAbits.LATA0 =0;
	LATAbits.LATA1 =0;
	DelayMs(1000);
	LATAbits.LATA0 =1;
	DelayMs(1000);
	LATAbits.LATA1 =1;

	TRISCbits.TRISC3=1;
	TRISCbits.TRISC4=1;
	LATGbits.LATG4 =0;
	LATCbits.LATC5 =1;
	TRISCbits.TRISC5=0;	 //LCD reset
	TRISGbits.TRISG4=0;
	//LATGbits.LATG4 =1;
	/*
	// Initialize application specific hardware
	InitializeBoard();

	#if defined(USE_LCD)
	// Initialize and display the stack version on the LCD
	LCDInit();
	DelayMs(100);
	strcpypgm2ram((char*)LCDText, "TCPStack " TCPIP_STACK_VERSION "  "
		"                ");
	LCDUpdate();
	#endif

	// Initialize stack-related hardware components that may be 
	// required by the UART configuration routines
	*/
    TickInit();
	DelayMs(1000);
	LATAbits.LATA0 =0;
	LATAbits.LATA1 =0;

	DelayMs(1000);
	// вывели lcd из ресета
	#define PCF8535_BUS_ADDRESS1 0b01111000
	#define PCF8535_BUS_ADDRESS2 0b01111010
	#define PCF8535_BUS_ADDRESS3 0b01111100
	#define PCF8535_BUS_ADDRESS4 0b01111110
	SSP1CON1bits.WCOL=0;
	OpenI2C(MASTER,SLEW_OFF);	// Setup MSSP for master I2C
	StartI2C1();
	DelayMs(1);	
	if(WriteI2C1(PCF8535_BUS_ADDRESS1)== 0)
		LATAbits.LATA0 =1;
	if(WriteI2C1(cmdLCD_DEFAULT_PAGE)== 0)
		LATAbits.LATA1 =1;
	StopI2C();
	//lcd_init();	
	//lcd_set_contrast(128);
	//lcd_send_data();
	//DelayMs(1000);
	/*
	#if defined(STACK_USE_MPFS) || defined(STACK_USE_MPFS2)
	MPFSInit();
	#endif

	// Initialize Stack and application related NV variables into AppConfig.
	InitAppConfig();

    // Initiates board setup process if button is depressed 
	// on startup
    if(BUTTON0_IO == 0u)
    {
		#if defined(EEPROM_CS_TRIS) || defined(SPIFLASH_CS_TRIS)
		// Invalidate the EEPROM contents if BUTTON0 is held down for more than 4 seconds
		DWORD StartTime = TickGet();
		LED_PUT(0x00);
				
		while(BUTTON0_IO == 0u)
		{
			if(TickGet() - StartTime > 4*TICK_SECOND)
			{
				#if defined(EEPROM_CS_TRIS)
			    XEEBeginWrite(0x0000);
			    XEEWrite(0xFF);
			    XEEWrite(0xFF);
			    XEEEndWrite();
			    #elif defined(SPIFLASH_CS_TRIS)
			    SPIFlashBeginWrite(0x0000);
			    SPIFlashWrite(0xFF);
			    SPIFlashWrite(0xFF);
			    #endif
			    
				#if defined(STACK_USE_UART)
				putrsUART("\r\n\r\nBUTTON0 held for more than 4 seconds.  Default settings restored.\r\n\r\n");
				#endif

				LED_PUT(0x0F);
				while((LONG)(TickGet() - StartTime) <= (LONG)(9*TICK_SECOND/2));
				LED_PUT(0x00);
				while(BUTTON0_IO == 0u);
				Reset();
				break;
			}
		}
		#endif

		#if defined(STACK_USE_UART)
        DoUARTConfig();
		#endif
    }

	// Initialize core stack layers (MAC, ARP, TCP, UDP) and
	// application modules (HTTP, SNMP, etc.)
    StackInit();

    #if defined(WF_CS_TRIS)
    WF_Connect();
    #endif

	// Initialize any application-specific modules or functions/
	// For this demo application, this only includes the
	// UART 2 TCP Bridge
	#if defined(STACK_USE_UART2TCP_BRIDGE)
	UART2TCPBridgeInit();
	#endif

	#if defined(STACK_USE_ZEROCONF_LINK_LOCAL)
    ZeroconfLLInitialize();
	#endif

	#if defined(STACK_USE_ZEROCONF_MDNS_SD)
	mDNSInitialize(MY_DEFAULT_HOST_NAME);
	mDNSServiceRegister(
		(const char *) "DemoWebServer",	// base name of the service
		"_http._tcp.local",			    // type of the service
		80,				                // TCP or UDP port, at which this service is available
		((const BYTE *)"path=/index.htm"),	// TXT info
		1,								    // auto rename the service when if needed
		NULL,							    // no callback function
		NULL							    // no application context
		);

    mDNSMulticastFilterRegister();			
	#endif
	*/
	// Now that all items are initialized, begin the co-operative
	// multitasking loop.  This infinite loop will continuously 
	// execute all stack-related tasks, as well as your own
	// application's functions.  Custom functions should be added
	// at the end of this loop.
    // Note that this is a "co-operative mult-tasking" mechanism
    // where every task performs its tasks (whether all in one shot
    // or part of it) and returns so that other tasks can do their
    // job.
    // If a task needs very long time to do its job, it must be broken
    // down into smaller pieces so that other tasks can have CPU time.
    while(1)
    {
        // Blink LED0 (right most one) every second.
		/*
        if(TickGet() - t >= TICK_SECOND/2ul)
        {
            t = TickGet();
            LATGbits.LATG4 ^= 1;
        }
		*/
		t++;
		if(t>=20000){
			t=0;
			//LATGbits.LATG4 ^= 1;
			//LATAbits.LATA1 ^= 1;
			t1++;
			if(t1>=255){
				t1=0;
			}
			//lcd_set_contrast(t1);
		}
		/*
        // This task performs normal stack task including checking
        // for incoming packet, type of packet and calling
        // appropriate stack entity to process it.
        StackTask();

        // This tasks invokes each of the core stack application tasks
        StackApplications();

        #if defined(STACK_USE_ZEROCONF_LINK_LOCAL)
		ZeroconfLLProcess();
        #endif

        #if defined(STACK_USE_ZEROCONF_MDNS_SD)
        mDNSProcess();
		// Use this function to exercise service update function
		// HTTPUpdateRecord();
        #endif

		// Process application specific tasks here.
		// For this demo app, this will include the Generic TCP 
		// client and servers, and the SNMP, Ping, and SNMP Trap
		// demos.  Following that, we will process any IO from
		// the inputs on the board itself.
		// Any custom modules or processing you need to do should
		// go here.
		#if defined(STACK_USE_GENERIC_TCP_CLIENT_EXAMPLE)
		GenericTCPClient();
		#endif
		
		#if defined(STACK_USE_GENERIC_TCP_SERVER_EXAMPLE)
		GenericTCPServer();
		#endif
		
		#if defined(STACK_USE_SMTP_CLIENT)
		SMTPDemo();
		#endif
		
		#if defined(STACK_USE_ICMP_CLIENT)
		PingDemo();
		#endif
		
		#if defined(STACK_USE_SNMP_SERVER) && !defined(SNMP_TRAP_DISABLED)
		//User should use one of the following SNMP demo
		// This routine demonstrates V1 or V2 trap formats with one variable binding.
		SNMPTrapDemo();
		
		#if defined(SNMP_STACK_USE_V2_TRAP) || defined(SNMP_V1_V2_TRAP_WITH_SNMPV3)
		//This routine provides V2 format notifications with multiple (3) variable bindings
		//User should modify this routine to send v2 trap format notifications with the required varbinds.
		//SNMPV2TrapDemo();
		#endif 
		if(gSendTrapFlag)
			SNMPSendTrap();
		#endif
		
		#if defined(STACK_USE_BERKELEY_API)
		BerkeleyTCPClientDemo();
		BerkeleyTCPServerDemo();
		BerkeleyUDPClientDemo();
		#endif

		ProcessIO();

        // If the local IP address has changed (ex: due to DHCP lease change)
        // write the new IP address to the LCD display, UART, and Announce 
        // service
		if(dwLastIP != AppConfig.MyIPAddr.Val)
		{
			dwLastIP = AppConfig.MyIPAddr.Val;
			
			#if defined(STACK_USE_UART)
				putrsUART((ROM char*)"\r\nNew IP Address: ");
			#endif

